week 3/lab3_part2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          122;
        startFace       14458;
    }
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          122;
        startFace       14580;
    }
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       14702;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       14762;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          14640;
        startFace       14822;
    }
)

// ************************************************************************* //
